[
  {
    "id": "stormlance_shock_assault",
    "name": "Shock Assault",
    "source": "Stormlance Task Force",
    "cost": "1CP",
    "type": "Battle Tactic Stratagem",
    "flavor_text": "The Adeptus Astartes are elite troops who strike with all the speed and fury of a searing thunderbolt.",
    "rules": {
      "when": "Your Charge phase.",
      "target": "One Adeptus Astartes Mounted unit from your army that has not declared a charge this phase.",
      "effect": "Until the end of the turn, you can re-roll Charge rolls made for your unit and melee weapons equipped by models in that unit have the [LANCE] ability."
    },
    "detachment_id": "stormlance_task_force",
    "keyword_requirements": ["MOUNTED"]
  },
  {
    "id": "stormlance_blitzing_fusillade",
    "name": "Blitzing Fusillade",
    "source": "Stormlance Task Force",
    "cost": "1CP",
    "type": "Battle Tactic Stratagem",
    "flavor_text": "Warriors of Stormlance Task forces can suddenly pour heavy and accurate fire into the enemy even as they race to finish off any survivors.",
    "rules": {
      "when": "Your Shooting phase.",
      "target": "One Adeptus Astartes Mounted unit from your army that has not been selected to shoot this phase.",
      "effect": "Until the end of the phase, ranged weapons equipped by models in your unit have the [ASSAULT] ability. If such a weapon already has this ability, until the end of the phase, that weapon has the [SUSTAINED HITS 1] ability as well."
    },
    "detachment_id": "stormlance_task_force",
    "keyword_requirements": ["MOUNTED"]
  },
  {
    "id": "stormlance_full_throttle",
    "name": "Full Throttle",
    "source": "Stormlance Task Force",
    "cost": "2CP",
    "type": "Wargear Stratagem",
    "flavor_text": "On the eve of riding down the most elusive prey, the task force's expert Techmarines will entreat the engine spirits of their vehicles, honing the iron steeds' performance to elicit even more speed from them.",
    "rules": {
      "when": "Your Movement phase.",
      "target": "One Adeptus Astartes Mounted or Adeptus Astartes Vehicle unit (excluding WALKERS) from your army.",
      "effect": "Until the end of the phase, if your unit Advances, do not make an Advance roll for it. Instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit, or 9\" instead if your unit is MOUNTED."
    },
    "detachment_id": "stormlance_task_force",
    "keyword_requirements": ["MOUNTED", "VEHICLE"]
  },
  {
    "id": "stormlance_ride_hard_ride_fast",
    "name": "Ride Hard, Ride Fast",
    "source": "Stormlance Task Force",
    "cost": "1CP",
    "type": "Battle Tactic Stratagem",
    "flavor_text": "Like zephyrs dancing across wide horizons, Space Marine riders and pilots can weave lithely around incoming fire with incredible skill.",
    "rules": {
      "when": "Your opponent's Shooting phase, just after an enemy unit has selected its targets.",
      "target": "One Adeptus Astartes Mounted or Adeptus Astartes Fly Vehicle unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
      "effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll and subtract 1 from the Wound roll."
    },
    "detachment_id": "stormlance_task_force",
    "keyword_requirements": ["MOUNTED", "FLY", "VEHICLE"]
  },
  {
    "id": "stormlance_wind_swift_evasion",
    "name": "Wind-Swift Evasion",
    "source": "Stormlance Task Force",
    "cost": "1CP",
    "type": "Strategic Ploy Stratagem",
    "flavor_text": "Space Marines are loathe to be brought into combat on any others' terms, especially the warriors of Stormlance Task Forces, whose battlefield tactics revolve around speed and precise, ferocious assaults.",
    "rules": {
      "when": "Your opponent's Movement phase, just after an enemy unit ends a Normal, Advance or Fall Back move.",
      "target": "One Adeptus Astartes Infantry or Adeptus Astartes Mounted unit from your army that is within 9\" of that enemy unit.",
      "effect": "Your unit can make a Normal move of up to 6\". RESTRICTIONS: You cannot select a unit that is within Engagement Range of one or more enemy units."
    },
    "detachment_id": "stormlance_task_force",
    "keyword_requirements": ["INFANTRY", "MOUNTED"]
  }
]